init-v2.org
**** org capture

C-RET  for creating new headlines
M-RET  for creating new lists
M-left/right/up/down

#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-org.el
    ;;安装最新版本 org 不使用内置版本
    (use-package org
      :pin gnu
      :ensure t)

    (use-package org-contrib
      :pin nongnu
      :ensure t
      :after org
      (require 'org-checklist))

    (require 'org-tempo)  ;开启easy template

    ;; 需要开启 electric-pair-mode
    ;; 禁用左尖括号
    (setq electric-pair-inhibit-predicate
	  `(lambda (c)
	     (if (char-equal c ?\<) t (,electric-pair-inhibit-predicate c))))

    (add-hook 'org-mode-hook
	      (lambda ()
		(setq-local electric-pair-inhibit-predicate
			    `(lambda (c)
			       (if (char-equal c ?\<) t (,electric-pair-inhibit-predicate c))))))
    ;; 更丰富的 TODO 状态
    (setq org-todo-keywords
	(quote ((sequence "TODO(t)" "STARTED(s)" "|" "DONE(d!/!)")
		(sequence "WAITING(w@/!)" "SOMEDAY(S)" "|" "CANCELLED(c@/!)" "MEETING(m)" "PHONE(p)"))))

    ;; need repeat task and properties
    (setq org-log-done t)
    (setq org-log-into-drawer t)

    ;; C-c C-s schedule
    ;; C-c C-d deadline
    (global-set-key (kbd "C-c a") 'org-agenda)
    (setq org-agenda-files '("~/org/gtd.org"))
    (setq org-agenda-span 'day)

    ;; see https://github.com/abo-abo/org-download/issues/131
    (use-package org-download
    :ensure t
    :after org
    :config
    (setq-default
     org-download-image-dir "~/org/images"
     ;; Basename setting seems to be simply ignored.
     org-download-screenshot-basename ".png"
     org-download-timestamp "org_%Y%m%d-%H%M%S_"
     org-image-actual-width 960
     org-download-heading-lvl nil)
    :custom
    (org-download-screenshot-method
     (cond
      ((eq system-type 'gnu/linux)
       "xclip -selection clipboard -t image/png -o > '%s'")
      ((eq system-type 'darwin)
       "pngpaste %s")))
    :bind
    (:map org-mode-map
	  (("C-M-y" . org-download-screenshot)
	   ("s-y" . org-download-yank))))  

    ;; Drag-and-drop to `dired`
    (add-hook 'dired-mode-hook 'org-download-enable)

  (defun org-apperance-evil-hack ()
    (add-hook 'evil-insert-state-entry-hook #'org-appear-manual-start nil t)
    (add-hook 'evil-insert-state-exit-hook #'org-appear-manual-stop nil t))

  (use-package org-appear
    :ensure t
    :after org
    :hook (org-mode . org-appear-mode)
    :init
    (setq org-appear-trigger 'manual)
    (add-hook 'org-mode-hook 'org-apperance-evil-hack))
  (use-package org-superstar
    :ensure t
    :after org
    :hook (org-mode . org-superstar-mode)
    :config
    (setq org-superstar-special-todo-items t))
  (use-package evil-org
    :ensure t
    :hook (org-mode . evil-org-mode)
    :after org
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))  

    (provide 'init-org)
#+END_SRC

*** 使用 use-package
use-package 实际上是一个宏，更好的取代 require 的方式，该宏允许你以一种既面向性能又整洁的方式隔离文件中的包配置。
更安全的 require ，如果加载 package 失败，require 会终止整个程序，而 use-pacakge 则只是在 message 中给出警告。
如果 package 不存在，则安装 package （使用 ensure 关键字）。
集中化配置，use-pacage 支持 init,config,autoload,bind 等关键字，方便管理加载包过程中的一些配置。
init 的代码在包加载之前执行，config 代码在包加载后执行，commands 可以在真正需要这个包时再加载, 提高启动速度, 避免无谓的 require.
bind 用于绑定快捷键。
*** init-evil.el
#+begin_src emacs-lisp  :tangle ~/.emacs.d/lisp/init-evil.el
  (use-package evil
    :ensure t
    :init
    ;; 不使用 evil 自带的 keybinding 
    (setq evil-want-keybinding nil)
    ;; 使用 vim 的 C-u 滚动界面操作
    ;; C-d C-u 向前翻页 向后翻页
    (setq evil-want-C-u-scroll t)
    ;; C-i 导致 orgmode 的 src 文件输入回车的时候，src 内容自动缩进了， orgmode 的C-i 就是缩进。
    ;;https://jeffkreeftmeijer.com/emacs-evil-org-tab/
    (setq evil-want-C-i-jump nil)
    (evil-mode)

    ;; https://emacs.stackexchange.com/questions/46371/how-can-i-get-ret-to-follow-org-mode-links-when-using-evil-mode
    (with-eval-after-load 'evil-maps
      (define-key evil-motion-state-map (kbd "RET") nil))

    ;; insert state 不使用 vi keybinding
    (setcdr evil-insert-state-map nil)
    (define-key evil-insert-state-map [escape] 'evil-normal-state)

    (define-key evil-normal-state-map (kbd "[ SPC") (lambda () (interactive) (evil-insert-newline-above) (forward-line)))
    (define-key evil-normal-state-map (kbd "] SPC") (lambda () (interactive) (evil-insert-newline-below) (forward-line -1)))


    (define-key evil-normal-state-map (kbd "[ b") 'previous-buffer)
    (define-key evil-normal-state-map (kbd "] b") 'next-buffer)
    (define-key evil-motion-state-map (kbd "[ b") 'previous-buffer)
    (define-key evil-motion-state-map (kbd "] b") 'next-buffer)

    (evil-define-key 'normal dired-mode-map
      (kbd "<RET>") 'dired-find-alternate-file
      (kbd "C-k") 'dired-up-directory
      "`" 'dired-open-term
      "q" 'quit-window
      "o" 'dired-find-file-other-window
      ")" 'dired-omit-mode)


    )

  ;; 支持 vim 的 redo undo ，而且更强大
  ;; u undo  C-r redo
  (use-package undo-tree
    :ensure t
    :diminish
    :init
    (global-undo-tree-mode 1)
    (setq undo-tree-auto-save-history nil)
    (evil-set-undo-system 'undo-tree))

  ;;文本搜索  doom modeline 会显示结果总数以及当前 index
  (use-package evil-anzu
    :ensure t
    :after evil
    :diminish
    :demand t
    :init
    (global-anzu-mode t))

  ;;社区更统一的定义各种常用 mode 下的 evil state
  (use-package evil-collection
    :ensure t
    :demand t
    :config
    (setq evil-collection-mode-list (remove 'lispy evil-collection-mode-list))
    (evil-collection-init)

    (cl-loop for (mode . state) in
	     '((org-agenda-mode . normal)
	       (Custom-mode . emacs)
	       (eshell-mode . emacs)
	       (org-mode . emacs)
	       (makey-key-mode . motion))
	     do (evil-set-initial-state mode state)))

  ;; vim surround plugin
  (use-package evil-surround
    :ensure t
    :init
    (global-evil-surround-mode 1))

  (use-package evil-nerd-commenter
    :ensure t
    :init
    (define-key evil-normal-state-map (kbd ",/") 'evilnc-comment-or-uncomment-lines)
    (define-key evil-visual-state-map (kbd ",/") 'evilnc-comment-or-uncomment-lines)
    )
  (use-package evil-snipe
    :ensure t
    :diminish
    :init
    (evil-snipe-mode +1)
    (evil-snipe-override-mode +1))

  ;; 按 % 跳转到匹配的符号，比如 () {} 甚至 begin end
  (use-package evil-matchit
    :ensure
    :init
    (global-evil-matchit-mode 1))

  ;; emacs 也有 multicusor 但是类 vim 的这个 iedit 操作更符合 vim 习惯
  ;; 在 normal 模式按 vim 选择当前 word，按 R 则会选择文本中所有的该 word
  ;; 此时可以按 gg 或者 G 跳转到匹配的 word 第一个 或者最后一个
  ;; 或者 0 $ 跳转到 word 的第一个单词/最后一个单词
  (use-package iedit
    :ensure t
    :init
    (setq iedit-toggle-key-default nil)
    :config
    (define-key iedit-mode-keymap (kbd "M-h") 'iedit-restrict-function)
    (define-key iedit-mode-keymap (kbd "M-i") 'iedit-restrict-current-line))

  (use-package evil-multiedit
    :ensure t
    :commands (evil-multiedit-default-keybinds)
    :init
    (evil-multiedit-default-keybinds))



  (provide 'init-evil)
#+end_src


vi 的各种模式 mode ，在 evil 中称为 state。
normal state 
insert state
emacs state 排除所有的 vi binding 回到 Emacs 的默认行为，通过 C-z 切换。
visual state
motion state 对只读 buffer 的一种模式。只能 motion 不能修改。
replace state 与 insert state 类似，除了是 replace 而不是 insert 。
operator-pending state
*** init-text-manipulation.el
强大的文本区域选择
而且支持将选择之后的文本，传输给其他命令，比如 搜索，高亮，替换 等等。
#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/init-text-manipulation.el
    (defun my/search-project-for-symbol-at-point ()
    (interactive)
    (if (use-region-p)
	(progn
	  (consult-ripgrep (project-root (project-current))
			   (buffer-substring (region-beginning) (region-end))))))

    (defun my/evil-quick-replace (beg end )
    (interactive "r")
    (when (evil-visual-state-p)
      (evil-exit-visual-state)
      (let ((selection (regexp-quote (buffer-substring-no-properties beg end))))
	(setq command-string (format "%%s /%s//g" selection))
	(minibuffer-with-setup-hook
	    (lambda () (backward-char 2))
	  (evil-ex command-string)))))

    (define-key evil-visual-state-map (kbd "C-r") 'my/evil-quick-replace)


    (use-package expand-region
    :ensure t
    :bind ("C-=" . er/expand-region)
    :config
    (defadvice er/prepare-for-more-expansions-internal
	(around helm-ag/prepare-for-more-expansions-internal activate)
      ad-do-it
      (let ((new-msg (concat (car ad-return-value)
			     ", H to highlight in buffers"
			     ", / to search in project, "
			     "e iedit mode in functions, "
			     "f to search in files, "
			     "b to search in opened buffers"))
	    (new-bindings (cdr ad-return-value)))
	(cl-pushnew
	 '("H" (lambda ()
		 (interactive)
		 (call-interactively
		  'my/highlight-dwim)))
	 new-bindings)
	(cl-pushnew
	 '("/" (lambda ()
		 (interactive)
		 (call-interactively
		  'my/search-project-for-symbol-at-point)))
	 new-bindings)
	(cl-pushnew
	 '("e" (lambda ()
		 (interactive)
		 (call-interactively
		  'evil-multiedit-match-all)))
	 new-bindings)
	(cl-pushnew
	 '("f" (lambda ()
		 (interactive)
		 (call-interactively
		  'find-file)))
	 new-bindings)
	(cl-pushnew
	 '("b" (lambda ()
		 (interactive)
		 (call-interactively
		  'consult-line)))
	 new-bindings)
	(setq ad-return-value (cons new-msg new-bindings)))))


    (defun my/highlight-dwim ()
    (interactive)
    (if (use-region-p)
	(progn
	  (highlight-frame-toggle)
	  (deactivate-mark))
      (symbol-overlay-put)))

  

  (use-package symbol-overlay
    :ensure t
    :config
    (define-key symbol-overlay-map (kbd "h") 'nil))

  (use-package highlight-global
    :ensure nil
    :commands (highlight-frame-toggle)
    :quelpa (highlight-global :fetcher github :repo "glen-dai/highlight-global")
    :config
    (progn
      (setq-default highlight-faces
		    '(('hi-red-b . 0)
		      ('hi-aquamarine . 0)
		      ('hi-pink . 0)
		      ('hi-blue-b . 0)))))
  (defun my/clear-highlight ()
    (interactive)
    (clear-highlight-frame) ;; highlight-global function
    (symbol-overlay-remove-all))


  (provide 'init-text-manipulation)

#+end_src

*** init-programming-basic.el
tree-sitter is an Emacs binding for Tree-sitter, an incremental parsing system.

It aims to be the foundation for a new breed of Emacs packages that understand code structurally. For example:
Faster, fine-grained code highlighting.
More flexible code folding.
Structural editing (like Paredit, or even better) for non-Lisp code.
More informative indexing for imenu.
#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/init-programming-basic.el
  ;; emacs29 内置 tree-sitter 
  ;; 安装所有 tree-sitter langs libs : M-x treesit-auto-install-all   
  (use-package treesit-auto
    :demand t
    :ensure t
    :init (setq treesit-font-lock-level 4)
    :config
    (setq treesit-auto-install 'prompt)
    (global-treesit-auto-mode))

  ;;查找定义和引用
  ;; xref-find-definitions   M-.
  ;; xref-find-references    M-?
  ;; xref-go-back            M-,
  ;; xref-go-forward         C-M-,


  ;; 使用 consult-imenu 列出文件内函数列表，方便跳转

  ;; emacs29 内置 eglot:A client for Language Server Protocol servers
  ;; lsp-mode 集成了很多包，功能丰富， eglot 功能相对简单
  (require 'eglot)


  (use-package yasnippet
  :ensure t
  :hook ((prog-mode . yas-minor-mode)
	 (org-mode . yas-minor-mode))
  :init
  :config
  (progn
    (setq hippie-expand-try-functions-list
	  '(yas/hippie-try-expand
	    try-complete-file-name-partially
	    try-expand-all-abbrevs
	    try-expand-dabbrev
	    try-expand-dabbrev-all-buffers
	    try-expand-dabbrev-from-kill
	    try-complete-lisp-symbol-partially
	    try-complete-lisp-symbol))))

  (use-package yasnippet-snippets
  :ensure t
  :after yasnippet) 

  (provide 'init-programming-basic)

#+end_src
